Repository: estelaV9/TFG_CubeX
Catalog: lib/l10n/app_*.arb
Languages: es

# training_reminders_button_hint
source: Shows info about weekly training reminders
es: Muestra información sobre recordatorios semanales para entrenar

# weekly_summary_title
source: Weekly Summaries
es: Resúmenes Semanales

# weekly_summary_description
source: Receive a weekly summary of your progress, times, and stats to track your evolution.
es: Recibe un resumen semanal de tu progreso, tiempos y estadísticas para que sigas viendo tu evolución.

# weekly_summary_button_title
source: Enable weekly summary
es: Activar resumen semanal

# weekly_summary_button_hint
source: Shows info about your weekly progress summary
es: Muestra información sobre el resumen de tu progreso semanal

# inactivity_notification_title
source: Inactivity Notifications
es: Notificaciones de Inactividad

# inactivity_notification_description
source: Get notified if you haven’t solved any cubes lately. Time to get back to practice!
es: Recibe un mensaje si no has resuelto ningún cubo en los últimos días. ¡Es hora de retomar la práctica!

# inactivity_notification_button_title
source: Enable inactivity notifications
es: Activar notificaciones por inactividad

# inactivity_notification_button_hint
source: Shows info about alerts for long inactivity
es: Muestra información sobre alertas de inactividad prolongada

# weekly_stats_title
source: Weekly Stats
es: Estadísticas Semanales

# weekly_stats_description
source: Receive a weekly report of your times and improvements.
es: Recibe un informe semanal sobre tus tiempos y mejoras.

# weekly_stats_button_title
source: Enable weekly stats
es: Activar estadísticas semanales

# weekly_stats_button_hint
source: Shows info about your weekly performance data
es: Muestra información sobre tus estadísticas de la semana

# hide_time_title
source: Hide running time
es: Ocultar el tiempo en ejecución

# hide_time_description
source: Do not show the timer while it's running to minimize distractions or performance pressure.
es: No mostrar el cronómetro mientras esté activo para evitar distracciones o reducir presión.

# hide_time_button_title
source: Hide running time
es: Ocultar tiempo en ejecución

# hide_time_button_hint
source: Keeps the time hidden until the resolution ends
es: No muestra el tiempo hasta que finalices la resolución

# record_time_alert_title
source: Record time alert
es: Alerta de tiempo récord

# record_time_alert_description
source: Get notified when you achieve your personal best time.
es: Recibe una notificación cuando consigas tu mejor tiempo personal.

# record_time_alert_button_title
source: Enable record alert
es: Activar alerta de récord

# record_time_alert_button_hint
source: Notifies you when you hit your best time
es: Te avisará cuando logres tu mejor tiempo

# best_average_alert_title
source: Best average alert
es: Alerta de mejor promedio

# best_average_alert_description
source: You'll be notified when you beat your average time (ao5, ao12, etc).
es: Se notificará cuando mejores tu promedio de tiempos (ao5, ao12, etc).

# best_average_alert_button_title
source: Enable best average alert
es: Activar alerta de mejor promedio

# best_average_alert_button_hint
source: Alerts you when you improve your averages
es: Recibirás alertas cuando superes tus promedios

# worst_time_alert_title
source: Worst time alert
es: Alerta de peor tiempo

# worst_time_alert_description
source: Get an alert when you achieve your personal worst time.
es: Recibe una alerta cuando consigas tu peor tiempo personal.

# worst_time_alert_button_title
source: Enable worst time alert
es: Activar alerta de peor tiempo

# worst_time_alert_button_hint
source: Notifies you when you hit your worst time
es: Te avisará cuando logres tu peor tiempo

# inspection_title
source: Inspection
es: Inspección

# advanced_options_title
source: Advanced options
es: Opciones avanzadas

# empty_stats_title
source: You haven’t recorded any time yet
es: Todavía no has registrado ningún tiempo

# empty_stats_label
source: The graph is empty
es: La gráfica está vacía

# empty_stats_hint
source: The graph is empty because no time has been recorded yet
es: La gráfica está vacía ya que no se ha registrado ningún tiempo

source: Alerts
es: Alertas

# inspection_description
source: Enables an inspection countdown before the solve time starts.
es: Activa una cuenta atrás de inspección antes de iniciar el tiempo de resolución.

# inspection_button_title
source: Enable inspection
es: Activar inspección

# inspection_button_hint
source: Shows a countdown before starting the solve
es: Muestra una cuenta atrás antes de comenzar la resolución

# inspection_time_title
source: Inspection Time (seconds)
es: Tiempo de inspección (segundos)

# inspection_time_description
source: Set how many seconds you'll have to inspect the cube before starting. By default, it's 15 seconds.
es: Define cuántos segundos tendrás para inspeccionar el cubo antes de empezar. Por defecto, serán 15 segundos.

# inspection_time_button_title
source: Change inspection seconds
es: Cambiar segundos de inspección

# inspection_time_button_hint
source: Choose how many seconds you'll have to inspect before solving
es: Elige cuántos segundos tendrás para inspeccionar antes de resolver

# time_default
source: Default
es: Predeterminado

# time_default_label
source: Default time
es: Tiempo predeterminado

# time_default_hint
source: Resets the inspection time to its default value (15 seconds)
es: Restablece el tiempo de inspección a su valor por defecto (15 segundos)

# inspection_time_form
source: Please enter a inspection time
es: Introduce un tiempo de inspección

# inspection_field_required
source: This field is required
es: Este campo es obligatorio

# inspection_only_numbers
source: Do not enter letters, only whole numbers
es: No introduzcas letras, solo números enteros

# inspection_range_1_59
source: You can only enter a value between 1 and 59
es: Solo puedes introducir un rango entre 1 a 59

# inspection_advanced_title
source: Inspection Alerts
es: Avisos durante la inspección

# alert_at_8_12_title
source: Alert at 8 and 12 seconds
es: Alerta a los 8 y 12 segundos

# alert_at_8_12_description
source: Enable alerts when there are 7 and 3 seconds left in the inspection.
es: Activa los avisos cuando queden 7 y 3 segundos de inspección.

# alert_at_8_12_button_title
source: Enable time alerts
es: Activar alertas de tiempo

# alert_at_8_12_button_hint
source: Enables an alert when 7 and 3 seconds remain during inspection
es: Activa una alerta cuando queden 7 y 3 segundos de inspección

# alert_type_title
source: Alert type
es: Tipo de alerta

# alert_type_description
source: Choose how alerts will be displayed during the inspection:
es: Elige cómo se mostrarán las alertas durante la inspección:

# inspection_alert_vibrant_type
source: Vibrant
es: Vibración

# inspection_alert_sound_type
source: Sound
es: Sonido

# inspection_alert_both_type
source: Both
es: Ambas

source: Delete
es: Eliminar

# delete_selected_times_button
source: Button to delete selected times
es: Botón para eliminar los tiempos seleccionados

source: Close selected time
es: Cerrar tiempo seleccionado

source: Reset
es: Reiniciar

# reset_notifications_button
source: Reset notifications
es: Reiniciar las notificaciones
