Repository: estelaV9/TFG_CubeX
Catalog: lib/l10n/app_*.arb
Languages: es

# main_title
source: Take your skills to the next level.
es: Lleva tus habilidades al siguiente nivel.

# main_title_hint
source: The title displayed at the top of the home screen
es: El título que se muestra en la parte superior de la pantalla de inicio

# login_label
source: Log in
es: Iniciar sesión

# login_hint
source: Button to log into your account
es: Botón para iniciar sesión en tu cuenta

# signup_label
source: Sign up
es: Regístrate

# signup_hint
source: Button to create a new account
es: Botón para crear una nueva cuenta

# login_screen_title
source: Login
es: Iniciar sesión

# login_screen_title_label
source: Login screen title
es: Título de la pantalla de inicio de sesión

# login_screen_title_hint
source: The title on the login screen
es: El título en la pantalla de inicio de sesión

# forgot_password
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# forgot_password_label
source: Forgot password link
es: Enlace para olvidar la contraseña

# forgot_password_hint
source: Link to reset password
es: Enlace para restablecer la contraseña

source: Sign in
es: Iniciar sesión

# sign_in_label
source: Sign in button
es: Botón de iniciar sesión

# sign_in_hint
source: Button to sign in to your account
es: Botón para iniciar sesión en tu cuenta

# no_account
source: Don't have an account?
es: ¿No tienes una cuenta?

# no_account_label
source: No account text
es: Texto de no tener cuenta

# no_account_hint
source: Text asking if the user has an account
es: Texto que pregunta si el usuario tiene cuenta

# sign_up_button
source: Sign up
es: Regístrate

# sign_up_button_label
source: Sign up button
es: Botón de registro

# sign_up_button_hint
source: Button to start signing up
es: Botón para comenzar a registrarse

# signup_screen_title
source: Sign Up
es: Registrarse

# signup_screen_title_label
source: Sign up screen title
es: Título de la pantalla de registro

# signup_screen_title_hint
source: The title on the sign up screen
es: El título en la pantalla de registro

# already_have_account
source: Already have an account?
es: ¿Ya tienes una cuenta?

# already_have_account_label
source: Already have an account text
es: Texto de ya tener cuenta

# already_have_account_hint
source: Text asking if the user already has an account
es: Texto que pregunta si el usuario ya tiene cuenta

# login_link
source: Log in
es: Iniciar sesión

# login_link_label
source: Login link
es: Enlace de iniciar sesión

# login_link_hint
source: Link to the login page
es: Enlace para ir a la página de inicio de sesión

source: Username
es: Nombre de usuario

# username_label
source: Username field
es: Campo de nombre de usuario

# username_hint
source: Enter your username
es: Escribe tu nombre de usuario

source: Mail
es: Correo

# mail_label
source: Mail field
es: Campo del correo

# mail_hint
source: Enter your mail
es: Escribe tu correo

source: Password
es: Contraseña

# password_label
source: Password field
es: Campo de contraseña

# password_hint
source: Enter your password
es: Escribe tu contraseña

source: Confirm password
es: Confirmar contraseña

# confirm_password_label
source: Confirm password field
es: Campo para confirmar la contraseña

# confirm_password_hint
source: Enter the same password before
es: Escribe la misma contraseña de antes

# time_label
source: Recorded time
es: Tiempo registrado

# time_hint
source: Show the recorded time
es: Se muestra el tiempo registrado

# dnf_label
source: Did Not Finish Button
es: Botón No Terminó

# dnf_hint
source: Indicates that the action was not completed and no result was achieved.
es: Indica que la acción no se completó y no se obtuvo un resultado.

# plus_two_label
source: Plus Two Button
es: Botón +2

# plus_two_hint
source: Indicates a penalty of two seconds added to the time.
es: Indica una penalización de dos segundos añadidos al tiempo.

# delete_cube_type_label
source: Delete Cube Type
es: Eliminar tipo de cubo

# delete_cube_type_hint
source: Are you sure you want to delete all your saved times with that cube?
es: ¿Estás seguro de que deseas eliminar todos tus tiempos guardados con ese cubo?

# cube_type_deleted_successful
source: Cube type deleted successfully
es: Tipo de cubo eliminado con éxito

# cube_type_deletion_failed
source: Cube type deletion failed. Please try again.
es: Error al eliminar el tipo de cubo. Por favor, inténtalo de nuevo.

# insert_new_type_label
source: Insert a new type
es: Insertar un nuevo tipo

# insert_new_type_hint
source: Enter a new cube type
es: Insertar un nuevo tipo

# enter_new_cube_type
source: Enter a new cube type
es: Introduce un nuevo tipo de cubo

# create_new_cube_type
source: Create a new cube type
es: Crear un nuevo tipo de cubo

# select_cube_type
source: Select a cube type
es: Selecciona un tipo de cubo

# add_custom_scramble_label
source: Add a custom scramble
es: Agregar un scramble personalizado

# enter_new_scramble
source: Enter a new scramble
es: Introduce un nuevo scramble

# delete_session_label
source: Delete Session
es: Eliminar sesión

# delete_session_hint
source: Are you sure you want to delete all your saved times?
es: ¿Estás seguro de que deseas eliminar todos tus tiempos guardados?

source: Session not found
es: Sesión no encontrada

# session_deleted_successful
source: Session deleted successfully
es: Sesión eliminada con éxito

# session_deletion_failed
source: Session deletion failed. Please try again.
es: Error al eliminar la sesión. Por favor, inténtalo de nuevo.

# select_session_label
source: Select a session
es: Selecciona una sesión

# create_new_session_label
source: Create a new session
es: Crear una nueva sesión

# create_new_session_button
source: Create a new session button
es: Boton para crear una sesión

# create_new_session_hint
source: Please enter a name for your new session
es: Por favor, introduce un nombre para tu nueva sesión

# type_session_name
source: Type the session name
es: Escribe el nombre de la sesión

source: Account created successfully
es: Cuenta creada con éxito

# accept_label
source: Accept
es: Aceptar

# accept_hint
source: Press to accept
es: Presiona para aceptar

# cancel_label
source: Cancel
es: Cancelar

# cancel_hint
source: Press to cancel
es: Presiona para cancelar

source: Copied successfully
es: Copiado con éxito

# copy_scramble
source: Copy scramble button
es: Botón copiar scramble

# new_type_inserted_successful
source: The new type was successfully inserted.
es: El nuevo tipo se insertó con éxito.

# chosen_name_already_exists
source: The chosen name already exists.
es: El nombre elegido ya existe.

# add_scramble_empty
source: Please add a scramble that isn't empty.
es: Por favor, agrega un scramble que no esté vacío.

source: Scramble added successful.
es: Scramble agregado con éxito.

# add_session_name_empty
source: Please add a session name that isn't empty.
es: Por favor, agrega un nombre de sesión que no esté vacío.

# session_added_successful
source: Session added successfully.
es: Sesión agregada con éxito.

# failed_create_session
source: Failed to create the session. Please try again.
es: Error al crear la sesión. Por favor, inténtalo de nuevo.

# incorrect_username_password
source: The username or password you entered is incorrect. Please try again.
es: El nombre de usuario o la contraseña que ingresaste son incorrectos. Por favor, inténtalo de nuevo.

# error_creating_account
source: An error occurred while creating the account.
es: Ocurrió un error al crear la cuenta.

# account_email_exists
source: An account with this email already exists.
es: Ya existe una cuenta con este correo electrónico.

# username_already_in_use
source: This username is already in use.
es: Este nombre de usuario ya está en uso.

source: Timer
es: Temporizador

source: App theme
es: Tema de la app

source: My profile
es: Mi perfil

source: Championship
es: Campeonato

source: Other
es: Otros

source: Settings
es: Configuraciones

source: About the app
es: Acerca de la app

source: Log out
es: Cerrar sesión

source: Show password
es: Mostrar contraseña

source: Hide password
es: Ocultar contraseña

# github
source: My github
es: Mi github

# go_github
source: Go to GitHub
es: Ir al github

source: Enter app
es: Entrar a la app

source: Delete account
es: Eliminar cuenta

source: Save data
es: Guardar datos

source: Edit button
es: Botón de editar

# delete_time
source: Delete time button
es: Botón eliminar tiempo

# add_comment
source: Add comments button
es: Botón agregar comentarios

# add_scramble_manual
source: Add scramble manually button
es: Botón agregar scramble manualmente

# reset_scramble
source: Reset scramble button
es: Btón restablecer scramble

# more_option
source: More options button
es: Botón más opciones

# add_new_time
source: Add new time button
es: Botón agregar nuevo tiempo

# add_penalty
source: Add a penalty button
es: Botón agregar penalización

source: Date
es: Fecha

source: Search time
es: Buscar tiempo

source: Choose session
es: Elije la sesión

source: Choose cube type
es: Elije el tipo de cubo

# description
source: CubeX is an app designed for speedcubers, offering advanced tools to train and improve times.
es: CubeX es una aplicación diseñada para speedcubers, ofreciendo herramientas avanzadas para entrenar y mejorar tiempos..

# open_source
source: CubeX is an open-source app
es: CubeX es una aplicación de código abierto

# developer
source: Main Developer
es: Desarrollador Principal

# tools
source: Main Tools
es: Herramientas Principales

source: Time Configuration
es: Configuración del tiempo

source: Account
es: Cuenta

source: Languages
es: Idiomas

# notification
source: Notifications
es: Notificaciones

# select_notification
source: Select notifications
es: Selecciona las notificaciones

source: Select languages
es: Selecciona un idioma

source: Configure timer
es: Configurar timer

source: Spanish
es: Español

# spanish_hint
source: Select the Spanish language
es: Selecciona el idioma español

source: English
es: Inglés

# english_hint
source: Select the English language
es: Selecciona el idoma inglés

# delete_time_correct
source: The time was deleted successfully
es: Se eliminó el tiempo correctamente

# delete_time_error
source: An error occurred while deleting the time
es: Ocurrió un error al eliminar el tiempo

# add_time_label
source: Add a time manually
es: Añade un tiempo manualmente

# add_time_hint
source: Form to add a time manually
es: Formulario para añadir un tiempo manualmente

# add_scramble_form_label
source: Add the scramble of the time
es: Añade el scramble del tiempo

# add_scramble_form_hint
source: Field to fill with the scramble of the time
es: Campo para rellenar con el scramble del tiempo

# add_time_form_label
source: Add the time
es: Añade el tiempo

# add_time_form_hint
source: Field to fill with the time
es: Campo para rellanar con el tiempo

# add_time_successfully
source: The time was added successfully
es: Se añadio el tiempo correctamente

# add_time_error
source: An error occurred while adding the time
es: Ocurrio un error al añadir el tiempo

# delete_user_successfully
source: The user was deleted successfully
es: Se eliminó el usuario correctamente

# delete_user_error
source: An error occurred while deleting the user
es: Ocurrió un error al eliminar usuario

# delete_all_times_label
source: Delete all session times
es: Eliminar todos los tiempos de la sesión

# delete_all_times_hint
source: Are you sure you want to delete all your saved times for this session?
es: ¿Estás seguro de que deseas eliminar todos tus tiempos guardados con esta sesión?

# all_times_deleted_successful
source: All times successfully deleted
es: Todos los tiempos eliminados con éxito

# all_times_deletion_failed
source: Failed to delete all times. Please try again.
es: Error al eliminar todos los tiempos. Por favor, inténtalo de nuevo.

# search_time_or_comments
source: Search time or comment...
es: Buscar tiempo o comentarios...

# update_user_successfully
source: User information was updated successfully
es: Se actualizó la información correctamente

# update_user_error
source: An error occurred while updating the user information
es: Ocurrió un error al actualizar información del usuario

source: Exit without saving
es: Salir sin guardar

# unsaved_changes_message
source: You have unsaved changes. Do you want to leave?
es: Tienes cambios sin guardar. ¿Quieres salir?

# insert_old_pass_label
source: Enter your old password
es: Ingresa tu antigüa contraseña

# insert_old_pass_hint
source: To continue and save changes, please enter your old password.
es: Para continuar y guardar los cambios, introduce tu antigüa contraseña.

# old_pass_form_label
source: Old Password
es: Contraseña antigüa

# old_pass_form_hint
source: Enter the password associated with your account
es: Introduce la contraseña asociada a tu cuenta

# old_pass_error
source: Incorrect password. Please try again.
es: Contraseña incorrecta. Inténtalo de nuevo.

source: Field null.
es: Campo vacio.

# confirm_pass_field_null
source: Confirm pass field is null.
es: El campo confirmar contraseña esta vacio.

# password_mismatch_error
source: The passwords do not match. Please try again.
es: Las contraseñas no coinciden. Intenta nuevamente.

# actual_delete_time
source: Are you sure you want to delete this time?
es: ¿Estás seguro de que deseas eliminar este tiempo?

# actual_delete_time_content
source: Once deleted, you won't be able to recover this time.
es: Una vez eliminado, no podrás recuperar este tiempo.

# add_comment_time
source: Add comment.
es: Añadir comentario.

# add_comment_time_content
source: Add comment to the registred time.
es: Añade un comentario al tiempo registrado.

# time_saved_error
source: An error occurred while saving the time
es: Ocurrió un error al guardar el tiempo

# time_error
source: An error occurred with the time
es: Ocurrió un error con el tiempo

# share_not_implemented
source: Sharing is not implemented for this platform
es: Compartir no está implementado para esta plataforma

# share_error
source: Error sharing
es: Error al compartir

# pdf_generation_error
source: Error generating the PDF
es: Error al generar el PDF

# no_times_found
source: No times found for this session
es: No se encontraron tiempos para esta sesión

# pdf_saved_success
source: PDF saved successfully.
es: PDF guardado con éxito.

source: Sort by
es: Ordenar por

source: Ascending
es: Ascendente

source: Descending
es: Descendente

source: Time
es: Tiempo

# close_popover
source: Close
es: Cerrar

# close_popover_hint
source: Close dialog
es: Cerrar dialogo

# ascending_hint
source: Button to sort in ascending order
es: Botón para ordenar ascendentemente

# descending_hint
source: Button to sort in descending order
es: Botón para ordenar descendentemente

# order_date_hint
source: Button to sort by date
es: Botón para ordenar por fecha

# order_time_hint
source: Button to sort by time
es: Botón para ordenar por tiempo

source: General Statistics
es: Estadísticas Generales

source: Best Single
es: Mejor Tiempo

source: Worst Single
es: Peor Tiempo

source: Solve Count
es: Número de Resoluciones

source: DNF Count
es: Conteo de DNF

# plus_two_count
source: +2 Count
es: Conteo de +2

source: DNF Percentage
es: Porcentaje de DNF

# plus_two_percentage
source: +2 Percentage
es: Porcentaje de +2

source: Total Solve Time
es: Tiempo Total de Resolución

# tooltip_best_single
source: Best recorded single time
es: Mejor tiempo individual registrado

# semantic_best_single
source: This column shows the best individual time
es: Esta columna muestra el mejor tiempo individual

# tooltip_worst_single
source: Worst recorded single time
es: Peor tiempo individual registrado

# semantic_worst_single
source: This column shows the worst individual time
es: Esta columna muestra el peor tiempo individual

# tooltip_solve_count
source: Total number of solves
es: Número total de resoluciones registradas

# semantic_solve_count
source: This column shows how many times you have solved
es: Esta columna muestra cuántas resoluciones hiciste

# tooltip_dnf_count
source: Number of DNF solves
es: Cantidad de intentos con penalización DNF

# semantic_dnf_count
source: This column shows the amount of DNFs (Did Not Finish)
es: Esta columna muestra los intentos no finalizados (DNF)

# tooltip_plus_two_count
source: Number of +2 solves
es: Cantidad de penalizaciones +2

# semantic_plus_two_count
source: This column shows the amount of +2 penalties
es: Esta columna muestra las resoluciones con penalización de +2 segundos

# tooltip_dnf_percentage
source: Percentage of DNFs
es: Porcentaje de penalizaciones DNF

# semantic_dnf_percentage
source: This column shows the percentage of DNFs
es: Esta columna muestra el porcentaje de DNFs

# tooltip_plus_two_percentage
source: Percentage of +2 penalties
es: Porcentaje de penalizaciones +2

# semantic_plus_two_percentage
source: This column shows the percentage of +2s
es: Esta columna muestra el porcentaje de +2

# tooltip_total_solve_time
source: Total time spent solving
es: Tiempo total invertido resolviendo

# semantic_total_solve_time
source: This column shows the accumulated time solving
es: Esta columna muestra el tiempo total de resolución acumulado

source: Performance Over Time
es: Rendimiento a lo largo del tiempo

source: Yearly
es: Anual

source: Monthly
es: Mensual

source: Daily
es: Diario

source: Graph Orientation
es: Orientación de la gráfica

# toggle_times_visibility
source: Toggle time labels visibility
es: Esconder o mostrar los tiempos de la gráfica

source: Average Analysis
es: Análisis de promedios

# average_analysis_label
source: Average Analysis
es: Análisis de promedios

# average_analysis_hint
source: Displays the average time analysis
es: Muestra el análisis de tiempos promedio

source: Current
es: Actual

# current_label
source: Current average time
es: Tiempo promedio actual

# current_hint
source: Average time over recent solves
es: Tiempo medio de las últimas resoluciones

source: Average
es: Media

# average_label
source: Average of times
es: Media de tiempos

# average_hint
source: Table showing the average of your times in the current session
es: Tabla con las medias de tus tiempos en la sesión

# ao5_label
source: Average of 5
es: Media de 5

# ao5_hint
source: Average time of last 5 solves
es: Tiempo promedio de las últimas 5 resoluciones

# ao12_label
source: Average of 12
es: Media de 12

# ao12_hint
source: Average time of last 12 solves
es: Tiempo promedio de las últimas 12 resoluciones

# ao50_label
source: Average of 50
es: Media de 50

# ao50_hint
source: Average time of last 50 solves
es: Tiempo promedio de las últimas 50 resoluciones

# ao100_label
source: Average of 100
es: Media de 100

# ao100_hint
source: Average time of last 100 solves
es: Tiempo promedio de las últimas 100 resoluciones

# aoTotal_label
source: Total average
es: Media total

# aoTotal_hint
source: Average time of all solves
es: Tiempo promedio de las todas las resoluciones

source: Best
es: Mejor

# best_label
source: Best averages
es: Mejores promedios

# best_hint
source: Best average times recorded
es: Mejores tiempos promedio registrados

source: Worst
es: Peor

# worst_label
source: Worst averages
es: Peores promedios

# worst_hint
source: Slowest average times recorded
es: Tiempos promedio más lentos

# total_average
source: Total average time
es: Media total de tiempos

# total_average_label
source: Total average
es: Media total

# total_average_hint
source: Average time for all solves in this session
es: Tiempo medio de todas las resoluciones en esta sesión

# session_deletion_failed_content_hint
source: At least one session must remain active.
es: Debe permanecer al menos una sesión activa.

# session_deletion_failed_content_label
source: Delete session failed
es: Eliminar sesión

# session_deletion_failed_content
source: The session cannot be deleted because it is the only active one.
es: No se puede eliminar la sesión porque es la única activa.

# cube_deletion_failed_content_hint
source: At least one cube type must remain active.
es: Debe haber al menos un tipo de cubo activo.

# cube_deletion_failed_content_label
source: Delete session
es: Eliminar tipo de cubo

# cube_deletion_failed_content
source: The cube type cannot be deleted because it is the only active one.
es: No se puede eliminar este tipo de cubo porque es el único activo.

# enable_notifications_title
source: Enable Notifications
es: Activar notificaciones

# enable_notifications_label
source: Notifications
es: Notificaciones

# enable_notifications_hint
source: Enable this to receive alerts
es: Activa esta opción para recibir alertas

# enable_notifications_description
source: Receive timely updates and important reminders directly on your device.
es: Recibe actualizaciones oportunas y recordatorios importantes directamente en tu dispositivo.

# enable_notifications_button_hint
source: Tap to enable notifications
es: Pulsa para activar las notificaciones

# enable_notifications_button_title
source: Activate notifications
es: Activar las notificaciones

# allow_notifications_title
source: Allow notifications
es: Permitir notificaciones

# allow_notifications_description
source: Receive reminders to improve your times and keep practicing.
es: Recibe recordatorios para mejorar tus tiempos y no olvides entrenar.

# toggle_button_title
source: Toggle notifications
es: Desactivar notificaciones

# toggle_button_hint
source: Tap to toggle notifications on or off.
es: Toca para desactivar las notificaciones.

# toggle_button_label
source: Notifications
es: Notificaciones

# daily_notifications_title
source: Daily Notifications
es: Notificaciones Diarias

# daily_notifications_description
source: Get a daily reminder to keep practicing and improve your times. Don’t forget to train!
es: Recibe un recordatorio diario para seguir practicando y mejorar tus tiempos. ¡No olvides entrenar!

# daily_notifications_button_title
source: Enable daily notifications
es: Activar notificaciones diarias

# daily_notifications_button_hint
source: Shows info about daily notifications
es: Muestra información sobre las notificaciones diarias

# weekly_motivation_title
source: Weekly Motivation
es: Motivación Semanal

# weekly_motivation_description
source: Receive weekly motivational messages to stay on track with your challenges. Never give up!
es: Recibe mensajes motivacionales semanales para seguir adelante con tus retos. ¡Nunca te rindas!

# weekly_motivation_button_title
source: Enable weekly motivation
es: Activar motivación semanal

# weekly_motivation_button_hint
source: Shows info about weekly motivational messages
es: Muestra información sobre los mensajes motivacionales semanales

# new_record_notification_title
source: Achievements and Records
es: Logros y Récords

# new_record_notification_description
source: Enable this option to get notified when you set a new personal best or achieve something important.
es: Activa esta opción para recibir notificaciones cuando consigas un nuevo récord personal o logros importantes.

# new_record_notification_button_title
source: Enable achievements and records
es: Activar logros y récords

# new_record_notification_button_hint
source: Shows info about new record notifications
es: Muestra información sobre las notificaciones de nuevos récords

# training_reminders_title
source: Training Reminders
es: Recordatorios de Entrenamiento

# training_reminders_description
source: Get reminders throughout the week to train and improve your solving speed. Keep the habit!
es: Recibe recordatorios para entrenar y mejorar tu velocidad de resolución a lo largo de la semana. ¡No pierdas la costumbre!

# training_reminders_button_title
source: Enable training reminders
es: Activar recordatorios de entrenamiento
